/**
 * জাভাস্ক্রিপ্টে find() একটি অ্যারে মেথড, যা একটি কলব্যাক ফাংশন ব্যবহার করে অ্যারের প্রথম উপাদানটি খুঁজে বের করে যা একটি নির্দিষ্ট শর্ত পূরণ করে। এটি মূলত এমন উপাদানটি খুঁজে বের করার জন্য ব্যবহার করা হয়, যা একটি লজিক্যাল শর্ত সত্য (true) করে।
 * 
 * array.find(callback(element, index, array), thisArg)
 * 
  const numbers = [5, 12, 8, 130, 44];

const found = numbers.find((element) => element > 10);

console.log(found); // Output: 12


 */

/*
জাভাস্ক্রিপ্টে findIndex() একটি অ্যারে মেথড, যা একটি কলব্যাক ফাংশন ব্যবহার করে অ্যারের প্রথম উপাদানের ইনডেক্স খুঁজে বের করে যা একটি নির্দিষ্ট শর্ত পূরণ করে। এটি শর্ত পূরণ করা উপাদানের অবস্থান (ইনডেক্স) রিটার্ন করে।
*/

var arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

var result = arr.find(function (value) {
  return value === 9;
});

console.log(result);
